app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Ridley Scott' LIMIT 1
---
  def director
    @movie = Movie.find(params[:movie_id])
    @movies = Movie.same_director(@movie.director) if @movie.director.present?